Autodesk.Revit.DB.BaseImportOptions.GetLayerSelection
Get all set layers name which user want to import into Revit.
Returns:
The layers' name.
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.SetLayerSelection(System.Collections.Generic.ICollection{System.String})
Set the layers name which user want to import into Revit.
Remarks:
If user don't set any layer selection, all layers would be imported into Revit for dgn.
But for dwg|dxf, all layers (or visible layers, it is up to visibleLayersOnly was set or not) would be imported into Revit.
layerSelection:
The layers imported into Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BaseImportOptions.ReferencePoint
The 3D point in the document where the imported instance will be inserted.
If not explicitly set, the instance will be inserted at the document origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.AutoCorrectAlmostVHLines
Correct almost-vertical lines and almost-horizontal lines for import model
if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.VisibleLayersOnly
Only import the visible layers.
Remarks:
If this option is set to true, only visible layers are imported.
For dgn import, this option is unsupported.
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.CustomScale
Scaling the import.
If this is defined and a valid value (> 0.0), it takes preference over units.
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.OrientToView
Place the import at the same orientation as the view that was passed into the import method.
This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.ThisViewOnly
Imports drawings into the view that was passed into the import method.
This option is not available in 3D views.
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.Placement
Where to place the import.
Set this option to place the view at the origin or the center, or a shared coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.ColorMode
Color mode for the import.
Three modes are supported. Black and White, Preserve Colors, and Invert Colors.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.BaseImportOptions.Unit
The unit of measure for imported geometry.
Remarks:
Units are used to calculate the import scale unless scale is defined explicitly using CustomScale, in which case Units will be ignored.
Feet, inches, meters, centimeters, decimeters, millimeters are all supported. If Default unit is set, Revit will read and use the units from the file. If units are not available or accessible there, Revit will default to inches.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.BaseImportOptions
A base class containing import options used during import of several formats.
Since:
2013